IoT-App-2569/Week-08-Kestrel-Web-Server/Code/Lab8-3/ESP32_ADC_Stream/sdkconfig.defaults
# ============================================================================
#  ค่าคอนฟิกเริ่มต้นของโปรเจกต์ (ใบงานที่ 8.2)
#  ----------------------------------------------------------------------------
#  ไฟล์นี้จะถูกอ่านตอนสร้าง sdkconfig ครั้งแรก ทำให้ไม่ต้องเข้า menuconfig เอง
#  และทำให้เพื่อนที่ clone โปรเจกต์ไปได้ค่าเหมือนกันทุกคน
#
#  หมายเหตุ : ห้าม commit ไฟล์ sdkconfig (ที่ระบบสร้างขึ้น) เพราะมีพาธเฉพาะเครื่อง
#             ให้ commit เฉพาะ sdkconfig.defaults นี้เท่านั้น
# ============================================================================

# ชิปเป้าหมาย — ถ้าใช้ ESP32-C6 ให้เปลี่ยนเป็น "esp32c6"
CONFIG_IDF_TARGET="esp32"

# ความเร็วพอร์ตอนุกรมของคอนโซล ต้องตรงกับฝั่ง C# (SerialPort(port, 115200))
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# ปิดข้อความ log ระดับ INFO ของระบบ ให้เหลือเฉพาะตัวเลข ADC ที่เรา printf ออกไป
# ช่วยให้ฝั่ง C# ใช้ int.TryParse() แล้วเจอบรรทัดขยะน้อยลง
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
